src/soap/ltest.start-ssession.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns="http://tempuri.org/ns.xsd">
 <SOAP-ENV:Body>
  <ns:start-ssession>
   <sDec>
    <StartTime>
     <tv-sec>0</tv-sec>
     <tv-usec>0</tv-usec>
    </StartTime>
    <StopTime>
     <tv-sec>0</tv-sec>
     <tv-usec>0</tv-usec>
    </StopTime>
    <sample-n>0</sample-n>
    <maxPDUSize>0</maxPDUSize>
    <ListenAddr>0</ListenAddr>
    <ListenPort>0</ListenPort>
    <Proto>P-TCP</Proto>
    <Prio>0</Prio>
    <TOS>0</TOS>
    <Block>false</Block>
    <SockOpts>
     <key></key>
     <value>0</value>
    </SockOpts>
    <SockOpts>
     <key></key>
     <value>0</value>
    </SockOpts>
   </sDec>
   <senderDesc>
    <LocalAddr>0</LocalAddr>
    <LocalPort>0</LocalPort>
    <RemoteAddr>0</RemoteAddr>
    <RemotePort>0</RemotePort>
    <RemoteURL></RemoteURL>
    <Bytes>0</Bytes>
    <Packets>0</Packets>
    <Proto>P-TCP</Proto>
    <StartTime>
     <tv-sec>0</tv-sec>
     <tv-usec>0</tv-usec>
    </StartTime>
    <Duration>
     <tv-sec>0</tv-sec>
     <tv-usec>0</tv-usec>
    </Duration>
    <FinishTime>
     <tv-sec>0</tv-sec>
     <tv-usec>0</tv-usec>
    </FinishTime>
    <Priority>0</Priority>
    <SType>ST-CBR</SType>
    <TOS>0</TOS>
    <BPS>0</BPS>
    <Size>0</Size>
    <FifoName></FifoName>
    <TimeCorrection>false</TimeCorrection>
    <MaxTimeDev>0</MaxTimeDev>
    <SockOpts>
     <key></key>
     <value>0</value>
    </SockOpts>
    <SockOpts>
     <key></key>
     <value>0</value>
    </SockOpts>
   </senderDesc>
  </ns:start-ssession>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
